; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (onconveyor ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (not (onconveyor ?x))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action put-conveyor
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?x))
		   (handempty)
		   (onconveyor ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-5-0)
(:domain BLOCKS)
(:objects D B A C E - block)
(:INIT (CLEAR E) (ONTABLE A) (ON E D) (ON D C) (ON C B) (ON B A) (HANDEMPTY))
(:goal (AND (ONCONVEYOR D) (ONCONVEYOR B) (ON E C) (ON C A) ))
)

; plan
1. (unstack e d)
   deleted: (clear e) (handempty) (on e d)
   added: (holding e) (clear d)
   goals met: 0 of 4
2. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 0 of 4
3. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 0 of 4
4. (put-conveyor d)
   deleted: (holding d)
   added: (handempty) (onconveyor d)
   goals met: 1 of 4
5. (unstack c b)
   deleted: (clear c) (handempty) (on c b)
   added: (holding c) (clear b)
   goals met: 1 of 4
6. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 1 of 4
7. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 1 of 4
8. (put-conveyor b)
   deleted: (holding b)
   added: (handempty) (onconveyor b)
   goals met: 2 of 4
9. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 2 of 4
10. (stack c a)
   deleted: (holding c) (clear a)
   added: (clear c) (handempty) (on c a)
   goals met: 3 of 4
11. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 3 of 4
12. (stack e c)
   deleted: (holding e) (clear c)
   added: (clear e) (handempty) (on e c)
   goals met: 4 of 4
